# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np
import random


#https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [48]:
a = pd.Series(np.random.randint(1,4,size=100))
b = pd.Series(np.random.randint(1,3,size=100))
c = pd.Series(np.random.randint(10000,30000,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [14]:
df = pd.concat([a, b, c], axis=1)
df

#https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

    0  1      2
0   3  2  19847
1   3  2  18289
2   3  2  11906
3   3  2  16555
4   3  2  21923
.. .. ..    ...
95  2  2  10026
96  2  1  12844
97  1  2  19542
98  2  2  15157
99  3  1  28290

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
df.rename(columns={0: "bedrs", 1: "bathrs", 2: "price_sqr_meter"}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       3       2            19847
1       3       2            18289
2       3       2            11906
3       3       2            16555
4       3       2            21923
..    ...     ...              ...
95      2       2            10026
96      2       1            12844
97      1       2            19542
98      2       2            15157
99      3       1            28290

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [53]:
#frame = { 'bigcolumn': a, 'bigcolumn': b, 'bigcolumn': c }
#result = pd.DataFrame(frame)
#result
frames = [a, b, c]
result = pd.concat(frames)
new = {'bigcolumn': result}
dfbig = pd.DataFrame(data=new)
dfbig

    bigcolumn
0           3
1           2
2           1
3           1
4           3
..        ...
95      17218
96      28908
97      16338
98      23774
99      28201

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [57]:
dfbig.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99,  0,  1,
        2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52,
       53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
       70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86,
       87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99,  0,  1,  2,  3,
        4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
       21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
       38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54,
       55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
       72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88,
       89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], dtype=int64)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [58]:
dfbig.reset_index()

     index  bigcolumn
0        0          3
1        1          2
2        2          1
3        3          1
4        4          3
..     ...        ...
295     95      17218
296     96      28908
297     97      16338
298     98      23774
299     99      28201

[300 rows x 2 columns]